// main types

var questionKeywords = {
  'چطور': 100,
  'کی ': 100,
  'کجا': 100,
  'چطوری': 100,
  'چگونه': 100,
  'چه ': 100,
  'میشه': 50,
  'میشود': 60,
  'می شود': 60,
  'میتوانی': 60,
  'می توانی': 60,
  'چه موقع': 100,
  'چه مکانی': 100,
  'چه جایی': 100,
  'بپرسم': 50,
  'چطوره': 100,
  'چطور است': 100,
  'چنده': 100,
  'کیست': 100,
  'چه کسی است': 100,
  'چیست': 100,
  'داری': 60,
  'چیه': 80,
  'چند': 80,
  '?': 100,
};

var commandKeywords = {
  'کن': 100,
  'کنید': 100,
  'بفرمای': 100,
  'بفرما': 100,
  'بفرمایید': 100,
  'بکن': 100,
  'بکنید': 100,
  'بگو': 100,
  'بگویید': 100,
  'بگوی': 100,
  'بخون': 100,
  'بخونید': 100,
  'بخوان': 100,
  'بخوانید': 100,
  'ببین': 100,
  'ببینید': 100,
  'برو': 100,
  'بروید': 100,
  'بخور': 100,
  'بخورید': 100,
  'بساز': 100,
  'بسازید': 100,
  'بده': 100,
  'بدهید': 100,
  'بگرد': 100,
  'بگردید': 100,
  'بگیر': 100,
  'بگیرید': 100,
  'بزنید': 100,
  'بزن': 100,
  'بشو': 100,
  'شو': 100,
};

var greetingKeywords = {
  'حال': 100,
  'خوشبختم': 100,
  'خوشبخت': 100,
  'خوشحالم': 100,
  'خوشحال': 100,
  'خوبی': 80,
  'خوب': 70,
  'حالت': 50,
  'امیدوارم': 100,
  'لذت': 50,
  'دوست': 70,
  'علاقه': 80,
};

var searchWords = {
  'سرچ': 100,
  'جستجو': 100,
  'بگرد': 100,
  'بیاب': 100,
  'پیدا کن': 100,
  'گوگل': 80,
};

var openAppWords = {
  'برنامه': 80,
  'اپلیکیشن': 100,
  'نرم افزار': 100,
  'باز کن': 100,
  'اجرا کن': 100,
};

var turnOnOffWords = {
  'روشن + کن': 100,
  'خاموش + کن': 100,
  'فعال + کن': 100,
  'غیر + فعال + کن': 100,
  'بلوتوث': 100,
  'دوربین': 100,
  'عکس + بگیر': 100,
  'عکس برداری': 100,
  'عکس + گرفتن': 100,
  'عکس': 50,
  'عکسبرداری': 100,
  'فیلم': 50,
  'فیلمبرداری': 100,
  'جی + پی + اس': 100,
  'مکان': 50,
  'مکان + روشن': 80,
  'مکان + خاموش': 80,
  'موقعیت': 50,
  'موقعیت + روشن': 80,
  'موقعیت + خاموش': 80,
  'وایفای': 90,
  'وای + فای': 90,
  'اطلاعات': 50,
  'اطلاعات + روشن': 80,
  'اطلاعات + خاموش': 80,
  'دیتا': 100,
  'هات + اسپات': 100,
  'نقطه + اتصال': 100,
  'بی صدا': 100,
  'بیصدا': 100,
  'هواپیما': 50,
  'حالت + هواپیما': 100,
};

var playMusicWords = {
  'آهنگ': 100,
  'موسیقی': 100,
  'موزیک': 100,
};

var playMovieWords = {
  'فیلم': 100,
  'ویدیو': 100,
  'کلیپ': 100,
};

var callWords = {
  'تماس + بگیر': 100,
  'تماس + گرفتن': 100,
  'تماس + برقرار کن': 100,
  'تماس + برقراری': 100,
  'زنگ': 100,
};

var textWords = {
  'پیام': 60,
  'اس ام اس': 100,
  'پیامک': 100,
};

var cancelWords = {
  'لغو',
  'بیخیال',
  'بی خیال',
  'ولش کن',
  'زنگ نزن',
  'تماس نگیر',
  'پیام نده',
  'ایمیل نده',
  'هیچکدام',
  'هیچ کدام',
};

var mailWords = {
  'ایمیل': 100,
  'جیمیل': 100,
  'نامه الکترونیکی': 100,
  'یاهو': 50,
  '@': 100,
};

var exitAppWords = {
  'خروج + برنامه': 100,
  'خارج + برنامه': 100,
  'ببند + برنامه': 100,
};

var weatherWords = {
  'آب و هوا': 100,
  'هواشناسی': 100,
  'هوا': 80,
};

var timeWords = {
  'زمان': 100,
  'ساعت': 90,
  'وقت': 90,
  'موقع': 70,
  'الان': 80,
  'حالا': 70,
  'امروز': 70,
  'چندمه': 80,
  'تاریخ': 90,
};

var personalWords = {
  'توانایی': 80,
  'قابلیت': 80,
  'سازنده': 80,
  'نام تو': 100,
  'نام': 80,
  'اسمت': 100,
  'اسم تو': 100,
  'چند سالته': 100,
  'چند سال': 90,
  'سال': 60,
  'علاقه': 70,
  'احساس': 100,
  'حسی': 80,
  'حس': 60,
  'عشق': 80,
};

var abilitiesWords = {
  'توانایی': 80,
  'قابلیت': 80,
  'امکان': 70,
};

var translateWords = {
  'به انگلیسی': 100,
  'به آلمانی': 100,
  'به عربی': 100,
  'به اسپانیایی': 100,
  'به ترکی': 100,
  'ترجمه': 100,
};

var whereWords = {
  'کجا': 100,
  'چه مکانی': 100,
  'چه مکان': 100,
};

var howWords = {
  'چگونه': 100,
  'چطوری': 60,
  'چه طوری': 60,
  'چطور': 100,
  'چه طور': 100,
  'نحوه': 100,
  'چگونگی': 100,
};
